[Table of Contents](../../index.ipynb)

# FRC Analytics with Python - Session 09
# Tabular Data
**Last Updated: 13 September 2020**

## I. Introduction
Tabular data is data that is organized into rows and columns. It's everywhere -- in newspapers and magazines, on websites, in computer databases, and in Microsoft Excel files. Evaluating and manipulating tabular data is an essential skill for any analyst.

So far we've experimented with lists, tuples, and dictionaries. These data structures are indispensable, but they are not optimal for working with tables. In this session we will review several techniques and tools for working with tabular data.

## II. Comma Separated Value (CSV) Files
### A. CSV File Structure
Tabular data is often stored in comma separated value (CSV) files. CSV files are text files that use commas and newline characters (I'll explain what those are shortly) to organize the contents of the file into a table. Let's look at an example. The `space.csv` file contains information on 4,324 space launches, starting with the launch of the the Sputnik spacecraft by the Soviet Union in 1957. The dataset is available on the [Kaggle website](https://www.kaggle.com/agirlcoding/all-space-missions-from-1957). The Python code below opens the file and displays the first five lines.

In [1]:
# Open a text file and print the first five lines
# Don't worry if you don't understand all of this code.
with open("space.csv", "rt", encoding="UTF-8") as csv_file:
    for row in range(5):
        print(csv_file.readline())

Company Name,Location,Datum,Detail,Status Rocket,Rocket,Status Mission

SpaceX,"LC-39A, Kennedy Space Center, Florida, USA","Fri Aug 07, 2020 05:12 UTC",Falcon 9 Block 5 | Starlink V1 L9 & BlackSky,StatusActive,50,Success

CASC,"Site 9401 (SLS-2), Jiuquan Satellite Launch Center, China","Thu Aug 06, 2020 04:01 UTC",Long March 2D | Gaofen-9 04 & Q-SAT,StatusActive,29.75,Success

SpaceX,"Pad A, Boca Chica, Texas, USA","Tue Aug 04, 2020 23:57 UTC",Starship Prototype | 150 Meter Hop,StatusActive,,Success

Roscosmos,"Site 200/39, Baikonur Cosmodrome, Kazakhstan","Thu Jul 30, 2020 21:25 UTC",Proton-M/Briz-M | Ekspress-80 & Ekspress-103,StatusActive,65,Success

The first row of text contains the column headings, with each column separated by a comma. The subsequent rows contain the data, with one row for each space launch. The rows are separated from each other with a newline character.

Commas are also used for separation in the data rows, but it's a bit difficult to keep track of what text belongs to which column. Many of the data values contain commas inside the data. For example, the second column in the first row contains the value *"LC-39A, Kennedy Space Center, Florida, USA"*. The commas within quotation marks are part of the data and are not used for column separation.

CSV files are popular because they are simple to create and can be opened and read with any text editor. Still, the content can be tedious to read. All of the values within a row are smashed together and the columns in the data rows do not line up with the column headers.

### B. Newline Characters
We have not yet covered newline characters. A newline character can occur in a string just like any other character. In Python (and many other programming languages) you can insert a newline character into a string using a backslash followed by an 'n', like so: `\n`.

In [4]:
# Placing a newline character in a string
multi_line_string = "This is line 1.\nThis is line 2."
multi_line_string

'This is line 1.\nThis is line 2.'

So far, the results are not impressive. The notebook is just displaying the newline character in the string. The outcome is better if we pass the string to the `print()` function.

In [5]:
print(multi_line_string)

This is line 1.
This is line 2.

Take another look at the first cell where we printed part of the CSV file. We used the `print()` function to display each row. Remember, the `print()` function automatically appends a newline character to the end of each line. Since each line of the CSV file already ends in a newline character, the `print()` function moves to a newline twice at the end of each line, which is why the output text is double-spaced. The newline character is an example of a control character, or an escape sequence. We'll discuss special charactes like this in more detail in session 12.

### C. Python CSV Module
We saw earlier how we can use a built-in Python function like `open()` to read data from a CSV file on disk, but the results can be difficult to read. The Python Standard Library has a `csv` module that makes things a little better.

In [2]:
import csv
space_csv = []
with open("space.csv", "rt", encoding="UTF-8") as csv_file:
    reader = csv.reader(csv_file)
    for row in reader:
        space_csv.append(row)

In [3]:
space_csv[:3]

[['Company Name',
  'Location',
  'Datum',
  'Detail',
  'Status Rocket',
  'Rocket',
  'Status Mission'],
 ['SpaceX',
  'LC-39A, Kennedy Space Center, Florida, USA',
  'Fri Aug 07, 2020 05:12 UTC',
  'Falcon 9 Block 5 | Starlink V1 L9 & BlackSky',
  'StatusActive',
  '50',
  'Success'],
 ['CASC',
  'Site 9401 (SLS-2), Jiuquan Satellite Launch Center, China',
  'Thu Aug 06, 2020 04:01 UTC',
  'Long March 2D | Gaofen-9 04 & Q-SAT',
  'StatusActive',
  '29.75',
  'Success']]

The `csv` module converts every row of the CSV file to a Python list. We appended every row to an outer list, to create a lists of lists, or a nested list. Each value is now put on its own row. We can even extract individual values from the nested list. For example, to get the third element of the third row:

In [4]:
space_csv[2][2]

'Thu Aug 06, 2020 04:01 UTC'

But what if we wanted to figure out how many space launches occurred in China on Wednesdays since the year 2000? That would require us to write several lines of code to read through all of the rows of data and count the applicable launches. Fortunately Python has a better tool for working with tabular data.

## III. Pandas Package

### A. Introduction
The *Pandas* package is an excellent tool for working with tabular data. Pandas is not included by default when installing Python, but it can easily be installed by running the command `conda install pandas`. Let's see how our space data looks when we use Pandas to view it.

In [4]:
import pandas as pd
space_df = pd.read_csv("space.csv")
space_df.head()

,Company Name,Location,Datum,Detail,Status Rocket,Rocket,Status Mission
0,SpaceX,"LC-39A, Kennedy Space Center, Florida, USA","Fri Aug 07, 2020 05:12 UTC",Falcon 9 Block 5 | Starlink V1 L9 & BlackSky,StatusActive,50,Success
1,CASC,"Site 9401 (SLS-2), Jiuquan Satellite Launch Ce...","Thu Aug 06, 2020 04:01 UTC",Long March 2D | Gaofen-9 04 & Q-SAT,StatusActive,29.75,Success
2,SpaceX,"Pad A, Boca Chica, Texas, USA","Tue Aug 04, 2020 23:57 UTC",Starship Prototype | 150 Meter Hop,StatusActive,NaN,Success
3,Roscosmos,"Site 200/39, Baikonur Cosmodrome, Kazakhstan","Thu Jul 30, 2020 21:25 UTC",Proton-M/Briz-M | Ekspress-80 & Ekspress-103,StatusActive,65,Success
4,ULA,"SLC-41, Cape Canaveral AFS, Florida, USA","Thu Jul 30, 2020 11:50 UTC",Atlas V 541 | Perseverance,StatusActive,145,Success

Now that is much better. All of the data lines up with the column headers. Pandas even adds row numbers and shades alternate rows to make everything easy to read. And we did everything in three short lines of code:
* The first line imports the pandas module and renames it `pd`.
* The next line reads the CSV file and creates a `DataFrame` object.
* The final line displays the `DataFrame` object. The `.head()` method causes only the first five lines to be displayed. You can customize the number of lines displayed with .head() by putting the number in the parenthesis.

By the way, the package isn't named *Pandas* because the developers really like pandas (but who doesn't like pandas?). *Pandas* is short for *panel data*. Panel data is common in the social sciences. It is multi-dimensional data on on multiple entities, with measurements taken at several points in time. For example, suppose we're conducting a study on family income over time. We might collect multiple pieces of data on each family, such as income, number of children, education level of parents, age of parents, whether they own their home, etc. If we collect such information on 500 families, and then update the information every year for five years, we have panel data.

Python's `len()` function can be used with dataframes to get the number of rows.

In [50]:
# Using len() with DataFrames
len(space_df)

4324

Pandas `DataFrame` objects have a `shape` attribute that contains a two-element tuple (immutable lists). The first element is the number of rows and the second is the number of columns.

In [53]:
print("Number of rows and columns:", space_df.shape)
print("Just the number of columns:", space_df.shape[1])

Number of rows and columns: (4324, 7)
Just the number of columns: 7

### B. Easy Pandas Exercises

**Ex. III.1** The `.head()` method will accept an integer argument that represents the number of rows to display. Display the first eight rows of the dataframe.

In [6]:
# Ex. III.1

**Ex. III.2** There is also a `tail()` method that will display the last few rows of a dataframe. Display the last 4 rows of the `space_df` dataframe.

In [7]:
# Ex. III.2

### C. Pandas Data Types
Pandas provides two different types of data structures: `Series` and `DataFrame`. 

#### DataFrame
What type of data structure is the `space_df` object?

In [6]:
# What type of object is space_df?
type(space_df)

pandas.core.frame.DataFrame

The `space_df` object is an object of type [`DataFrame`](https://pandas.pydata.org/pandas-docs/stable/user_guide/dsintro.html#dataframe). Most `DataFrame` objects are two-dimensional with rows and columns. `DataFrames` can be modified to contain data with three or more dimensions, such as panel data, but we won't bother with that in this course.

Pay attention to the capitalization of `DataFrame` (capital F). We're using the word "dataframe" a couple different ways. A dataframe is a two-dimensional data structure that can be found in Python, [R](https://en.wikipedia.org/wiki/R_(programming_language) (a language for statistical analysis), and [Julia](https://en.wikipedia.org/wiki/Julia_(programming_language) (a relatively new language that is good for numerical analysis). A `DataFrame`, on the other hand, is a Python data type provided by the *Pandas* package.

#### Series
The following code extracts a single column from the `space_df` dataframe and displays its type.

In [5]:
# pandas.Series data type
datum_series = space_df.Datum.head(6)  # Extract a single column(named Datum in this case) and display top six rows
print(datum_series)
type(datum_series)

0    Fri Aug 07, 2020 05:12 UTC
1    Thu Aug 06, 2020 04:01 UTC
2    Tue Aug 04, 2020 23:57 UTC
3    Thu Jul 30, 2020 21:25 UTC
4    Thu Jul 30, 2020 11:50 UTC
5    Sat Jul 25, 2020 03:13 UTC
Name: Datum, dtype: object

pandas.core.series.Series

See how we extracted a single column from the `DataFrame` by appending a period and its name to the name of the `DataFrame`? Extracting a single column results in a Pandas [`Series`](https://pandas.pydata.org/pandas-docs/stable/user_guide/dsintro.html#series) object. A `Series` is similar to a list, but with some differences:
* Unlike a Python list, all elements of a `Series` must have the same data type. The *Datum* column's type is *object*, which is the type Pandas uses for strings.
* The contents of a Pandas `Series` are stored in memory more efficiently than lists. Because of this, calculations on `Series` objects are often faster than equivalent calculations on lists.

We will mostly use `DataFrame` objects instead of `Series` objects. But it's important to know what `Series` objects are because that's what we'll end up with whenever we extract a single column from a dataframe.

### D. Selecting Data within Pandas Dataframes
Pandas provides an immense number of ways to select and extract data from a dataframe, many more than can be covered in this class. Check out the [official Pandas documentation](https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html) to see for yourself. The Pandas documentation often refers to selecting data as *indexing*, which may seem strange at first. Think about it like this - to extract the fourth item from a list called `mylist`, we put the number 3 in square brackets: `fourth_num = mylist[3]`. The number 3 is the index position of the lists fourth element of the list. We're selecting a value from the list by passing an index to the list.

#### Selecting a Single Column
Select a single column by using a dictionary-style notation. Place the column name in quotes and square brackets. This technique works for all columns regardless of their name.

In [38]:
# Extracting a single column
space_df["Status Mission"]

0       Success
1       Success
2       Success
3       Success
4       Success
         ...
4319    Failure
4320    Success
4321    Failure
4322    Success
4323    Success
Name: Status Mission, Length: 4324, dtype: object

The dictionary style also works with a string variable that contains the column name.

In [15]:
col_var = "Status Rocket"
space_df[col_var]

0        StatusActive
1        StatusActive
2        StatusActive
3        StatusActive
4        StatusActive
            ...
4319    StatusRetired
4320    StatusRetired
4321    StatusRetired
4322    StatusRetired
4323    StatusRetired
Name: Status Rocket, Length: 4324, dtype: object

#### Selecting Part of a Single Column
We can select one or more rows from a single column the same way we select portions of a list.

In [6]:
space_df.Detail[100:105] # Detail is the name of the column

100                                  H-IIB | HTV-8
101        Long March 3B/YZ-1 | BeiDou-3 M23 & M24
102              Long March 11 | Zhuhai-1 Group 03
103    Long March 4B | Ziyuan-2D, BNU-1 & Taurus-1
104                   Kuaizhou 1A | KX-09 & Others
Name: Detail, dtype: object

#### Selecting Multiple Columns
Multiple columns can be selected by passing a list of column names within square brackets. We can even change the column order.

In [7]:
space_df[["Location", "Company Name", "Status Mission"]] 
# Notice how with more than 1 specified column name, you need 2 sets of square brackets

,Location,Company Name,Status Mission
0,"LC-39A, Kennedy Space Center, Florida, USA",SpaceX,Success
1,"Site 9401 (SLS-2), Jiuquan Satellite Launch Ce...",CASC,Success
2,"Pad A, Boca Chica, Texas, USA",SpaceX,Success
3,"Site 200/39, Baikonur Cosmodrome, Kazakhstan",Roscosmos,Success
4,"SLC-41, Cape Canaveral AFS, Florida, USA",ULA,Success
...,...,...,...
4319,"LC-18A, Cape Canaveral AFS, Florida, USA",US Navy,Failure
4320,"LC-26A, Cape Canaveral AFS, Florida, USA",AMBA,Success
4321,"LC-18A, Cape Canaveral AFS, Florida, USA",US Navy,Failure
4322,"Site 1/5, Baikonur Cosmodrome, Kazakhstan",RVSN USSR,Success
4323,"Site 1/5, Baikonur Cosmodrome, Kazakhstan",RVSN USSR,Success

#### Selecting Rows
You might be tempted to select a row from a `DataFrame` the same way we select an element from a list. Resist that temptation, it won't work. Use `.loc[]` instead.

In [21]:
# Selecting part of a DataFrame with the `.loc()` function
space_df.loc[0:3, "Company Name":"Datum"]

,Company Name,Location,Datum
0,SpaceX,"LC-39A, Kennedy Space Center, Florida, USA","Fri Aug 07, 2020 05:12 UTC"
1,CASC,"Site 9401 (SLS-2), Jiuquan Satellite Launch Ce...","Thu Aug 06, 2020 04:01 UTC"
2,SpaceX,"Pad A, Boca Chica, Texas, USA","Tue Aug 04, 2020 23:57 UTC"
3,Roscosmos,"Site 200/39, Baikonur Cosmodrome, Kazakhstan","Thu Jul 30, 2020 21:25 UTC"

To use the `.loc` function, pass two elements within square brackets, separated by a comma. The first element specifies what rows are selected, and the second specifies what columns are selected. List-style slice notation can be used to select ranges of rows and columns. In the example above, we selected rows 0 through 3 and columns "Company Name" through "Datum".

One difference between Pandas dataframe slice notation differs and Python list notation is that for Python lists, the slice does NOT return the final element. For example:

In [39]:
# Python list slices include all elements up to but NOT including the final
# element in the slice
# Will return 3 list items
tens = [0, 10, 20, 30, 40, 50, 60]
tens[0:3]  # The fourth element, 30, is not returned.

[0, 10, 20]

In [42]:
# Slices in DataFrames will include the final element of the slice
# Returns 4 rows and 4 columns
space_df.loc[0:3, "Detail":"Status Mission"]

,Detail,Status Rocket,Rocket,Status Mission
0,Falcon 9 Block 5 | Starlink V1 L9 & BlackSky,StatusActive,50,Success
1,Long March 2D | Gaofen-9 04 & Q-SAT,StatusActive,29.75,Success
2,Starship Prototype | 150 Meter Hop,StatusActive,NaN,Success
3,Proton-M/Briz-M | Ekspress-80 & Ekspress-103,StatusActive,65,Success

Rows and columns need not be contiguous. We can pass in lists of row indices and column names.

In [44]:
space_df.loc[[100, 200, 300, 400], ["Detail", "Datum", "Rocket"]]

,Detail,Datum,Rocket
100,H-IIB | HTV-8,"Tue Sep 24, 2019 16:05 UTC",112.5
200,"H-IIA 202 | Ibuki 2, KhalifaSat & Others","Mon Oct 29, 2018 04:08 UTC",90
300,Soyuz 2.1b | Cosmos 2524,"Sat Dec 02, 2017 10:43 UTC",35
400,Long March 5/YZ-2 | Shijian-17,"Thu Nov 03, 2016 12:42 UTC",NaN

### E. Pandas Indexing Exercises

**Ex III.3** Display the datums and company names for rows 1318, 2976, and 4131.

In [ ]:
# Ex III.3

**Ex III.4** Display the final 10 rows of the *Detail* column.

In [48]:
space_df["Detail"][-10:]

4314        Vanguard | Vanguard TV5
4315    Sputnik 8A91 | Sputnik-3 #1
4316            Juno I | Explorer 3
4317          Vanguard | Vanguard 1
4318            Juno I | Explorer 2
4319      Vanguard | Vanguard TV3BU
4320            Juno I | Explorer 1
4321        Vanguard | Vanguard TV3
4322     Sputnik 8K71PS | Sputnik-2
4323     Sputnik 8K71PS | Sputnik-1
Name: Detail, dtype: object

### F. Searching Within a Dataframe
Being able to extract data by row and column numbers is helpful at times, but it requires that we know the exact location of the data we want. In large dataframes with thousands of rows, we typically do NOT know the exact location. Fortunately, Pandas provides many techniques for searching within a dataframe

In [16]:
# Searching for Specific Data in Dataframe
# How many successful space launches were conducted by the U.S. Navy?
space_df[(space_df["Company Name"] == "US Navy") & (space_df["Status Mission"] == "Success")]

,Company Name,Location,Datum,Detail,Status Rocket,Rocket,Status Mission
4291,US Navy,"LC-18A, Cape Canaveral AFS, Florida, USA","Tue Feb 17, 1959 15:55 UTC",Vanguard | Vanguard 2,StatusRetired,NaN,Success
4317,US Navy,"LC-18A, Cape Canaveral AFS, Florida, USA","Mon Mar 17, 1958 12:15 UTC",Vanguard | Vanguard 1,StatusRetired,NaN,Success

In [18]:
# Alternate search technique using the `query()` method
space_df.query("`Company Name` == 'US Navy' and `Status Mission` == 'Success'")

,Company Name,Location,Datum,Detail,Status Rocket,Rocket,Status Mission
4291,US Navy,"LC-18A, Cape Canaveral AFS, Florida, USA","Tue Feb 17, 1959 15:55 UTC",Vanguard | Vanguard 2,StatusRetired,NaN,Success
4317,US Navy,"LC-18A, Cape Canaveral AFS, Florida, USA","Mon Mar 17, 1958 12:15 UTC",Vanguard | Vanguard 1,StatusRetired,NaN,Success

In [8]:
space_df.columns

Index(['Company Name', 'Location', 'Datum', 'Detail', 'Status Rocket',
       'Rocket', 'Status Mission'],
      dtype='object')

In [8]:
pd.to_datetime(space_df.Datum)[4291]

datetime.datetime(1959, 2, 17, 15, 55, tzinfo=tzutc())

In [12]:
pd.unique(space_df["Status Mission"])

array(['Success', 'Failure', 'Prelaunch Failure', 'Partial Failure'],
      dtype=object)

In [40]:
space_df.loc[:, :]

,Company Name,Location,Datum,Detail,Status Rocket,Rocket,Status Mission
0,SpaceX,"LC-39A, Kennedy Space Center, Florida, USA","Fri Aug 07, 2020 05:12 UTC",Falcon 9 Block 5 | Starlink V1 L9 & BlackSky,StatusActive,50,Success
1,CASC,"Site 9401 (SLS-2), Jiuquan Satellite Launch Ce...","Thu Aug 06, 2020 04:01 UTC",Long March 2D | Gaofen-9 04 & Q-SAT,StatusActive,29.75,Success
2,SpaceX,"Pad A, Boca Chica, Texas, USA","Tue Aug 04, 2020 23:57 UTC",Starship Prototype | 150 Meter Hop,StatusActive,NaN,Success
3,Roscosmos,"Site 200/39, Baikonur Cosmodrome, Kazakhstan","Thu Jul 30, 2020 21:25 UTC",Proton-M/Briz-M | Ekspress-80 & Ekspress-103,StatusActive,65,Success
4,ULA,"SLC-41, Cape Canaveral AFS, Florida, USA","Thu Jul 30, 2020 11:50 UTC",Atlas V 541 | Perseverance,StatusActive,145,Success
...,...,...,...,...,...,...,...
4319,US Navy,"LC-18A, Cape Canaveral AFS, Florida, USA","Wed Feb 05, 1958 07:33 UTC",Vanguard | Vanguard TV3BU,StatusRetired,NaN,Failure
4320,AMBA,"LC-26A, Cape Canaveral AFS, Florida, USA","Sat Feb 01, 1958 03:48 UTC",Juno I | Explorer 1,StatusRetired,NaN,Success
4321,US Navy,"LC-18A, Cape Canaveral AFS, Florida, USA","Fri Dec 06, 1957 16:44 UTC",Vanguard | Vanguard TV3,StatusRetired,NaN,Failure
4322,RVSN USSR,"Site 1/5, Baikonur Cosmodrome, Kazakhstan","Sun Nov 03, 1957 02:30 UTC",Sputnik 8K71PS | Sputnik-2,StatusRetired,NaN,Success
4323,RVSN USSR,"Site 1/5, Baikonur Cosmodrome, Kazakhstan","Fri Oct 04, 1957 19:28 UTC",Sputnik 8K71PS | Sputnik-1,StatusRetired,NaN,Success

In [24]:
space_df.loc[1318, :]

Company Name                                            Arianespace
Location          ELA-2, Guiana Space Centre, French Guiana, France
Datum                                    Tue Apr 28, 1998 22:53 UTC
Detail                            Ariane 44P | Nilesat-101, BSAT-1B
Status Rocket                                         StatusRetired
Rocket                                                          NaN
Status Mission                                              Success
Name: 1318, dtype: object

In [19]:
# Selecting the entire row with the '.iloc()' function
print(space_df.iloc[2]) #gets the 3rd row of df (second index)
type(space_df.iloc[2])

Company Name                                  SpaceX
Location               Pad A, Boca Chica, Texas, USA
Datum                     Tue Aug 04, 2020 23:57 UTC
Detail            Starship Prototype | 150 Meter Hop
Status Rocket                           StatusActive
Rocket                                           NaN
Status Mission                               Success
Name: 2, dtype: object

pandas.core.series.Series

### Making your own DataFrames from scratch

In [60]:
x = pd.DataFrame({'x': [1, 2, 3], 'y': [3, 4, 5]})
x

   x  y
0  1  3
1  2  4
2  3  5

In [61]:
# You can also assign a dict to a row of a DataFrame
x.iloc[1] = {'x': 9, 'y': 99}
x

   x   y
0  1   3
1  9  99
2  3   5

In [62]:
x = x.append({'x': 5, 'y': 9}, ignore_index = True)
x

   x   y
0  1   3
1  9  99
2  3   5
3  5   9

In [63]:
x['z'] = [1, 2, 3, 4]
x

   x   y  z
0  1   3  1
1  9  99  2
2  3   5  3
3  5   9  4

In [65]:
z = pd.DataFrame({'x': [1, 2, 3], 'y': [3, 4, 5], 'z': [45, 45, 56]})
z

   x  y   z
0  1  3  45
1  2  4  45
2  3  5  56

In [77]:
#You can append 2 dataframes together
x = x.append(z)
x

   x   y   z
0  1   3   1
1  9  99   2
2  3   5   3
3  5   9   4
0  1   3  45
1  2   4  45
2  3   5  56
0  1   3  45
1  2   4  45
2  3   5  56

## VII. Quiz
Answer the following questions by typing the answers as comments in the code block below each question.

**#1.** One of these lines of code will create an error. Which one? Why?
```python
dvar1 = {[1, 2]: "three"}
dvar2 = {(1, 2): "three"}
```

In [89]:
#
#

**#2.** Which of the data types listed below are mutable?
* string 
* integer
* float
* list
* tuple
* dictionary
* boolean

In [11]:
#
#

**#3.** What method can be used to loop over a dictionaries keys *and* values?

In [12]:
#
#

## VIII. Save Your Work
Once you have completed the exercises, save a copy of the notebook outside of the git repository (outside of the *pyclass_frc* folder). Include your name in the file name. Send the notebook file to another student to check your answers.

## IX. Concept and Terminology Review
You should be able to define the following terms or describe the concept.
* Composite data type
* Immutable data Type
* Mutable data type
* Dictionary
* Key
* Value
* `dict()` function
* Looping with dictionaries
* `.keys()` method
* `.values()` method
* `.items()` method
* Tuples
* Tuple packing
* Tuple unpackign
* `tuple()` function
* Composite data types that contain other composite data types.

### Notes for later

The newline characters were not *completely* hidden in the original example -- you can see that they are present. There will be a quiz question on that later.

[Table of Contents](../../index.ipynb)